Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: མ་ལ་ངས་འདི་འཇིགས་སུ་གཞུག་གོ་སྙམ་དུ་ཐུགས་སུ་ཆུད་ནས་གནོད་སྦྱིན་ལག་ན་རྡོ་རྗེ་ལ་བཀའ་སྩལ་པ།
en: Therefore, I will frighten him.”

source: ལག་ན་རྡོ་རྗེ་ཀླུའི་རྒྱལ་པོ་སོག་མ་མེད་འཇིགས་པར་གྱིས་ཤིག །དེ་ནས་གནོད་སྦྱིན་ལག་ན་རྡོ་རྗེས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ཏེ།
en: Having thought this, he ordered the yakṣa Vajrapāṇi, “Vajrapāṇi, frighten the nāga king Apalāla.” “Certainly,” replied the yakṣa Vajrapāṇi to the Blessed One, and he threw a vajra at a mountain peak.

source: རྡོ་རྗེ་རིའི་རྩེ་ལ་འཕངས་ནས་རིའི་རྩེ་མོ་བཤིག་སྟེ་ལྷུང་བ་དེས་ཀླུའི་རྒྱལ་པོ་སོག་མ་མེད་ཀྱི་གནས་ནོན་པར་གྱུར་ཏོ།
en: The mountain peak shattered and fell, flattening the residence of the nāga king Apalāla.

source: །དེ་ནས་སོག་མ་མེད་སྔངས་སྐྲག་ཕོངས་ནས་འབྲོས་པར་བརྩམས་པ་དང་། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མེའི་ཁམས་ལ་སྙོམས་པར་ཞུགས་ནས་ཕྱོགས་ཐམས་ཅད་འབར་རབ་ཏུ་འབར།
en: Then Apalāla, frightened, terrified, and dejected, tried to run away. The Blessed One then meditated on the element of fire. Burning, thoroughly burning, thoroughly and entirely burning, everything in all directions blazed as a single flame.

source: ཀུན་དུ་རབ་ཏུ་འབར་ཏེ་མེ་ལྕེ་གཅིག་ཏུ་གྱུར་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་ཞི་ཞིང་བསིལ་བར་གྱུར་པ་མ་གཏོགས་པར་དེ་གང་དང་གང་དུ་སོང་བ་དེ་དང་དེ་ན་མི་མཐོང་ངོ་།
en: The nāga found fire wherever he went, except under the feet of the Blessed One, where it was calm and cool.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་ནས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་བདག་ལ་ཐོ་བཙམ་ལགས་སམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒ་བའི་ཆོས་ཅན་ཅི་ངས་ཐོ་བཙམས་སམ།
en: Thereupon he went to the Blessed One, and when he arrived, he threw himself at the Blessed One’s feet and said, “O Blessed One, why do you harass me?” The Blessed One replied, “O one naturally subject to old age, why do I harass you? You are harassing me.

source: གལ་ཏེ་ངས་ཡོན་ཏན་གྱི་ཚོགས་འདི་ལྟ་བུ་དག་མ་ཐོབ་ན། ཁྱོད་ཀྱིས་ང་མིང་ལུས་པར་བྱས་པར་འགྱུར་རོ།
en: If I had not attained a number of good qualities like I have, you would have killed me and only my name would have remained.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱག་འཁོར་ལོ་དང་། བཀྲ་ཤིས་དང་། གཡུང་དྲུང་འཁྱིལ་པ་དང་། དྲ་བས་འབྲེལ་བ།
en: The Blessed One then touched the crown of the nāga’s head with his hand, which was marked with a chakra, swastika, and nandyāvarta; whose fingers were connected with a web;

source: བསོད་ནམས་བརྒྱ་ཕྲག་དུ་མས་བསྒྲུབས་པ།
en: which had been generated by hundreds of merits;

source: འཇིགས་པ་རྣམས་དབུགས་འབྱིན་པར་མཛད་པས་སྤྱི་བོ་ལ་རེག་པར་མཛད་ནས་བཀའ་སྩལ་པ། བཞིན་བཟངས་ཁྱོད་ཀྱིས་བུམ་པ་བཟང་པོ་ལྟ་བུའི་ཉན་ཐོས་ཆེན་པོ་བཞི་ལ་ཟན་བྱིན་ཏེ། སུམ་བཅུ་རྩ་གསུམ་གྱི་ལྷ་གྱ་ནོམ་པ་དག་གི་ནང་དུ་སྐྱེ་བར་འགྱུར་བ་ལས་ཁྱོད་ཀྱིས་སྨོན་ལམ་ལོག་པར་བཏབ་པས་དུད་འགྲོ་རྣམས་སུ་སྐྱེས་ཏེ།
en: and which comforts those who are frightened, and said, “Sir, since you offered a meal to four great disciples who are like wish-fulfilling vases, you should have been born among the glorious Thirty-Three Gods. But, having made a misguided aspiration, you were born among animals.

source: རྡེག་པ་དང་གསོད་པ་ལ་ཞེན་ཅིང་ཕ་རོལ་གྱི་སྲོག་འཕྲོག་པ་དང་། ཕ་རོལ་གྱི་སྲོག་ལ་གནོད་པ་བྱེད་པས་འཚོ་བར་བྱེད་ན།
en: You have spent your life with the desire to beat and kill, depriving others of their lives and harming others’ lives.

source: འདི་ནས་ཤི་འཕོས་ནས་སེམས་ཅན་དམྱལ་བ་མ་གཏོགས་པར་ཁྱོད་ཀྱི་འགྲོ་བ་ནི་གང་ཞིག་ཡིན། སྐྱེ་བ་ནི་གང་ཞིག་ཡིན། ཚེ་ཕྱི་མ་ནི་གང་ཞིག་ཡིན།
en: Where, then, will your next mode of existence, next birth, next existence after dying in this world be, but in hell?”

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཅི་ཞིག་བགྱི་བ་བཀའ་སྩལ་དུ་གསོལ།
en: “O Blessed One, please tell me what I should do.”

source: བཞིན་བཟངས་ཚུར་ང་ལས་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་ཟུང་ལ།
en: “Sir, now seek refuge in me, accept the rules of training, and grant freedom from fear to the people living in the country of Magadha.”

source: ཡུལ་མ་ག་དྷཱ་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ལ་མི་འཇིགས་པ་བྱིན་ཅིག །བཙུན་པ་བདག་དེང་སླན་ཅད་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་སྐྱབས་སུ་མཆི་བ་དང་བསླབ་པའི་གཞི་རྣམས་མནོས་ནས་ཡུལ་མ་ག་དྷཱ་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ལ་ཡང་མི་འཇིགས་པ་སྩལ་བར་བགྱིའོ།
en: “O Honored One, from today onward, having sought refuge in the Blessed One and accepted the rules of training, I will grant freedom from fear to the people living in the country of Magadha.”

source: །དེ་ནས་དེའི་ཆུང་མ་དང་། བུ་མོ་དང་མནའ་མ་རྣམས་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དང་ཆོས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་བདག་ཅག་ཀྱང་སྐྱབས་སུ་མཆི་ཞིང་བསླབ་པའི་གཞི་རྣམས་ནོད་ལགས་སོ།
en: Then his wife, daughter, and son’s wife said, “We, too, will seek refuge in the Blessed One, the Dharma, and the community of monks and keep the rules of training.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་ལ་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བྱིན་ནོ།
en: The Blessed One gave them refuge and the rules of training.

source: །དེའི་བུ་རི་བོས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ཀྱང་སྐྱབས་སུ་མཆི་བ་དང་བསླབ་པའི་གཞི་རྣམས་ནོད་ལགས་སོ།
en: Mountain, the nāga’s son, said, “O Blessed One, I, too, will seek refuge and keep the rules of training.”

source: །སོག་མ་མེད་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ཅག་ཀླུ་རྣམས་ནི་མི་མཛའ་བ་མང་བ་ལགས་ཀྱིས། རི་བོ་ལ་སྐྱབས་སུ་མཆི་བ་སྩལ་ཅིང་བསླབ་པའི་གཞི་རྣམས་ནི་མི་དཔོག་པར་གསོལ།
en: “O Blessed One,” said Apalāla, “since we nāgas have many foes, please do not give the rules of training to Mountain, even though you bestow on him refuge;

source: འདིས་བདག་ཅག་བསྲུངས་པར་འགྱུར་ལགས་སོ།
en: he will protect us.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་སྐྱབས་སུ་འགྲོ་བ་བྱིན་ནོ།
en: The Blessed One gave him refuge.

source: །དེ་ནས་གནོད་སྦྱིན་ལག་ན་རྡོ་རྗེས་སོག་མ་མེད་གྲོགས་པོ་དང་། གཉེན་འདབ་དང་། མཛའ་བཤེས་རྣམས་བཏུལ་བར་གྱུར་པ་མཐོང་ནས་ཡིད་རབ་ཏུ་དགའ་བས་གར་བྱས་ཏེ་སྨྲས་པ།
en: Then the yakṣa Vajrapāṇi, having seen Apalāla, his companions, family, and friends converted, danced with his mind pleased and said:

source: ཁྲོས་པས་ལྕེ་བསྐྱོད་མགོ་མང་བསྒུལ་ནས་མཚོན་ཆའི་འཁོར་ལོ་འབེབས།
en: “Tongue trembling with rage, his many heads shaking, he caused a rain of weapons like discuses.

source: །རང་གནས་སྐྱེས་བུ་རང་ལ་ཕྱོགས་པ་རི་མཐོ་རྩེ་ལྟ་བུ།
en: Faced by the humans in their own homes like high mountain peaks,

source: །དུ་མའི་ཚོགས་ལྷགས་ངལ་ཆད་དབུགས་བརྫགས་བཟུར་ཅིང་ལྟ་བྱེད་པ།
en: Beheld and avoided by many people who wearily gasp for breath,

source: །སྦྲུལ་བདག་སོག་མ་མེད་དེ་དྲང་སྲོང་བཀའ་བཙན་རྣམས་ཀྱིས་བཏུལ།
en: He was converted by the Ṛṣi’s instructions.” H.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སོག་མ་མེད་འཁོར་དྲུག་ཁྲི་དང་བཅས་པ་བཏུལ་ནས་གདན་ལས་བཞེངས་ཏེ་གཤེགས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚལ་སྔོ་ཞིང་སྔོ་བ་བསྒྲེངས་པ་དག་གཟིགས་སོ།
en: The Nāga Huluḍa Thereupon the Blessed One, having converted Apalāla with his sixty thousand attendants, rose from his seat and departed.

source: །གཟིགས་ནས་ཀྱང་གནོད་སྦྱིན་ལག་ན་རྡོ་རྗེ་ལ་བཀའ་སྩལ་པ། ལག་ན་རྡོ་རྗེ་ཁྱོད་ཀྱིས་ཚལ་སྔོ་ཞིང་སྔོ་བ་བསྒྲེངས་པ་དག་མཐོང་ངམ།
en: When the Blessed One saw a green forest rising before them, he said to the yakṣa Vajrapāṇi, “Vajrapāṇi, do you see that green forest rising before us?”

source: །ལག་ན་རྡོ་རྗེ་དེ་ནི་ཁ་ཆེའི་ཡུལ་ཡིན་ཏེ།
en: “Vajrapāṇi, that is the country of Kaśmīra.

source: ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ལོ་བརྒྱ་ལོན་ནས་དགེ་སློང་ཀུན་དགའ་བོའི་ལྷན་ཅིག་གནས་པ་དགེ་སློང་ཉི་མའི་གུང་ཞེས་བྱ་བ་འབྱུང་བར་འགྱུར་ཏེ།
en: When a hundred years have passed after I am completely emancipated, there will be a monk there named Madhyandina, who will be a co-residential pupil of the monk Ānanda.

source: །དེས་ཀླུ་གདུག་པ་ཧུ་ལུ་དུ་བཏུལ་ནས་ཐབས་བཤམས་ཏེ་དེ་ལས་སྐྱིལ་མོ་ཀྲུང་ཤོང་བའི་ས་བླངས་ནས་ཁ་ཆེའི་ཡུལ་ཀུན་དུ་བསྟན་པ་འཇོག་པར་འགྱུར་རོ།
en: When he (Madhyandina) has converted the wicked nāga Huluḍa, he will devise a plan to make the teaching prevail all over the country of Kaśmīra, having received a place for seated meditation.

source: །ངའི་ལྷག་མཐོང་དང་རྗེས་སུ་མཐུན་པའི་གནས་མལ་རྣམས་ཀྱི་ནང་ན་འདི་ལྟ་སྟེ། ཁ་ཆེའི་ཡུལ་མཆོག་ཏུ་འགྱུར་ཏེ།
en: The country of Kaśmīra will become the best of the dwelling places that are suited to my insight.

source: གྲོང་ཁྱེར་དང་གྲོང་རྡལ་དྲུག་ཁྲི་དང་། གྲོང་རྡལ་དྲུག་སྟོང་དང་། གྲོང་རྡལ་དྲུག་བཅུ་རྩ་གསུམ་པོ་འདི་རྣམས་ནི་ཁ་ཆེའི་ཡུལ་ཡིན་ནོ།
en: The country of Kaśmīra consists of the city and sixty thousand towns, six thousand towns, and sixty-three towns.” I. Bhraṣṭolā, Ṛṣi, Āpannaka

source: །ཡུལ་གཉིད་འགྲོགས་སུ་དྲང་སྲོང་དང་གནོད་སྦྱིན་ཉམས་པ་འཁོར་དང་བཅས་པ་བཏུལ་ལོ།
en: The Blessed One converted a ṛṣi and the yakṣa Āpannaka, along with his attendants, in the country of Bhraṣṭolā. J. Kanthā

source: །ཡུལ་གན་ཐར་གནོད་སྦྱིན་མོ་འཁོར་དང་བཅས་པ་བཏུལ་ལོ།
en: The Blessed One converted a yakṣiṇī, along with her attendants, in the country of Kanthā. K. In Dhānyapura, Converting the Mother of Best Army

source: །འབྲས་ཀྱི་གྲོང་ཁྱེར་དུ་བྱོན་ནས་འབྲས་ཀྱི་གྲོང་ཁྱེར་དུ་རྒྱལ་པོ་སྡེ་མཆོག་གི་མ་བདེན་པ་རྣམས་ལ་རབ་ཏུ་བཞག་གོ།
en: The Blessed One, having arrived at Dhānyapura, established in the truths the mother of the king Best Army there. L. The Potter in Naitarī

source: །ཡུལ་དབང་ལྡན་དུ་བྱོན་ཏེ།
en: The Blessed One arrived at Naitarī, where there was a certain potter.

source: དབང་ལྡན་ན་རྫ་མཁན་གཞན་ཞིག་ཡོད་པ་དེ་བཟོས་ཤིན་ཏུ་རྒྱགས་ཏེ་སྣོད་རྣམས་སྐམས་ནས་འཁོར་ལོ་ལས་འགོགས་པར་བྱེད་དོ།
en: Excessively proud of his art, he was taking vessels off of the wheel after he had dried them.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་གདུལ་བའི་དུས་མཁྱེན་ནས་རྫ་མཁན་གྱི་ཆ་བྱད་དུ་ཉིད་མངོན་པར་སྤྲུལ་ཏེ་དེ་དང་ལྷན་ཅིག་གཏམ་བྱ་བར་བརྩམས་པ།
en: The Blessed One, knowing it was the time to convert him, dressed as a potter and began a conversation with him:

source: ཁྱོད་ཀྱིས་སྣོད་ཅི་འདྲ་བ་དག་ཅིག་འཁོར་ལོ་ལས་འབེབས་པར་བྱེད།
en: “What vessels are you putting down from the wheel?”

source: དེས་གསོལ་པ། བསྐམས་ནས་འབེབས་སོ།
en: “I put them down after having dried them,” he answered.

source: །ང་ཡང་བསྐམས་ནས་འབེབས་སོ།
en: “I put mine down after having dried them, too.”

source: །ཁྱོད་དང་བདག་མཉམ་ལགས་སོ།
en: “You and I are equal.”

source: །འདི་ཁོ་ནར་ཟད་དམ་ཅི།
en: “Why am I only this?

source: ང་ནི་སོ་བཏང་ནས་ཀྱང་འབེབས་སོ།
en: I put mine down after having fired them, too.”

source: །ཁྱོད་ལྷག་གོ།
en: “You are superior to me.”

source: །སོ་གཏོང་བ་འབའ་ཞིག་ཏུ་ཡང་མ་ཟད་དོ། །འོ་ན་ཅི་ཞེ་ན། གསེར་དང་། དངུལ་དང་། བཻ་ཌཱུརྱ་དང་། ཤེལ་གྱི་རང་བཞིན་དུ་ཡང་བྱེད་དོ།
en: “I not only fire them, but also change them into ones made of gold, silver, lapis lazuli, and crystal.”

source: །དེ་མངོན་པར་དད་པར་གྱུར་ཏོ།
en: He was filled with faith.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྫ་མཁན་གྱི་ཆ་བྱད་མི་སྣང་བར་མཛད་དེ་རང་བཞིན་གྱི་ཆ་བྱད་དུ་བཞུགས་ནས་དེ་འཁོར་གྱི་སྐྱེ་བོ་དང་བཅས་ཏེ་བདེན་པ་རྣམས་ལ་རབ་ཏུ་བཀོད་དོ།
en: The Blessed One then removed his guise as a potter and assumed his own appearance. He established the potter, along with his attendants, in the truths. XI. Śādvalā A.

source: །གསིང་མ་ཅན་དུ་གཤེགས་ནས་གསིང་མ་ཅན་དུ་གནོད་སྦྱིན་ཆེན་པོ་འཁོར་དང་བཅས་པ་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་ལ་རབ་ཏུ་བཞག་གོ།
en: The Great Yakṣa of Śādvalā The Blessed One went to Śādvalā. He let a great yakṣa with his attendants in Śādvalā seek refuge in him and established them in the rules of training. B. Pālitakūṭa

source: །བརྩེགས་སྐྱོང་དུ་ཀླུ་བ་ལང་སྐྱོང་དང་། དགར་བ་གཉིས་སོ།
en: In Pālitakūṭa, the Blessed One converted two nāgas, Gopālaka and Separating. XII.

source: །དགའ་འཕེལ་དུ་གཤེགས་ནས་དགའ་འཕེལ་དུ་རྒྱལ་པོ་སྲིད་པའི་ལྷ་འཁོར་དང་བཅས་པ་དང་། གཏུམ་བྱེད་ཀྱི་བུ་བདུན་དང་། གནོད་སྦྱིན་ས་འཚོ་བདེན་པ་དག་ལ་རབ་ཏུ་བཀོད་དོ།
en: Nandivardhana A. Bhavadeva’s, Caṇḍālī’s Seven Sons’, and the Yakṣa Earth-Protector’s Conversion in Nandivardhana The Blessed One went to Nandivardhana, where he established the king, Bhavadeva, along with his attendants, the seven sons of Caṇḍālī, and the yakṣa Earth-Protector, in the truths. B. Giving an Image to Nāgas, Aśvaka, and Punarvasuka

source: །དེ་ན་མཚོ་ཆེན་པོ་ཡོད་པ་གང་ཡིན་པ་དེ་ན་འགྲོ་མགྱོགས་དང་། ནབ་སོ་གཉིས་ཀླུའི་སྐྱེ་གནས་སུ་སྐྱེས་ཏེ་ལོ་བཅུ་གཉིས་འདས་ཤིང་སྟེང་དུ་བྱུང་སྟེ་འཁྲུགས་པས་འདི་སྐད་ཅེས་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ཅག་ལ་ཆོས་མ་བཤད་པས་དེས་ན་བདག་ཅག་རྣམ་པར་ལྟུང་བ་ཀླུའི་སྐྱེ་གནས་སུ་སྐྱེས་ཀྱིས་ཅི་ནས་བདག་ཅག་གིས་དེའི་བསྟན་པ་གཞིག་པར་བྱའོ་ཞེས་སྨྲའོ།
en: In a large lake, Aśvaka and Punarvasuka were born from the wombs of nāgas. After spending twelve years in the lake, they appeared on the water and said angrily, “Since the Blessed One did not preach the Dharma to us, we have fallen into this state; we were born from the wombs of nāgas. Therefore, let us destroy his teaching.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་འདི་སྙམ་དུ་དགོངས་ཏེ། ཀླུ་འགྲོ་མགྱོགས་དང་ནབ་སོ་ནི་འདི་ལྟར་མཐུ་ཆེ་ཞིང་རྫུ་འཕྲུལ་ཆེ་བ་ཡིན་པས་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ངའི་བསྟན་པ་ཐལ་བར་རླག་པར་འགྱུར་བ་གང་ཡིན་པའི་གནས་འདི་ཡོད་དོ་སྙམ་དུ་མཁྱེན་ནས།
en: Then the Blessed One thought, “Since the nāgas Aśvaka and Punarvasuka are of great dignity and magical power, it is possible that they will smash my teaching into pieces after I am completely emancipated.”

source: བཅོམ་ལྡན་འདས་ཀླུ་འགྲོ་མགྱོགས་དང་། ནབ་སོ་གཉིས་གང་ན་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས་འགྲོ་མགྱོགས་དང་། ནབ་སོ་གཉིས་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then went to the two nāgas, Aśvaka and Punarvasuka.

source: འགྲོ་མགྱོགས་དང་། ནབ་སོ་ཚིག་བཞི་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཞེས་བྱ་བ་ཡོད་པ་བཤད་ཀྱིས་ཤེས་པར་བྱོས་ཤིག །བཙུན་པ་བདག་ཅག་དམ་པའི་ཆོས་འཚལ་བར་བགྱིད་པ་སུ་ཞིག་མཆིས་སྙམ་དུ་རིག་ནས།
en: When he arrived, he said to the two, Aśvaka and Punarvasuka, “Aśvaka and Punarvasuka, there is a teaching device of the Dharma called four phrases. I will teach it to you; you should know it.” “O Honored One, who will make us desire the true Dharma?”

source: དེ་ཉིད་དུ་སླར་ཞུགས་ཏེ། དེ་གཉིས་འདི་སྙམ་དུ་སེམས་སོ།
en: They both entered the water again.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ནི་བདག་ཅག་ལ་ཆོས་བཤད་ན་བདག་ཅག་གིས་རྣམ་པར་མ་ཤེས་སོ་སྙམ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱོགས་དེར་སྐུའི་གཟུགས་བརྙན་བཏང་ནས་འགྲོ་མགྱོགས་དང་། ནབ་སོ་གཉིས་ཀྱིས་དེ་ལ་བལྟས་ཤིང་བལྟས་ཤིང་བཅོམ་ལྡན་འདས་ད་དུང་བཞུགས་པ་ལྟ་ཞེས་སླར་ཡང་དང་ཡང་དུ་ཞུགས་སོ།
en: They thought, “Even if the Blessed One teaches the Dharma to us, we will not understand it.” The Blessed One left an image of himself at that place. Whenever the two, Aśvaka and Punarvasuka, saw it, they went back into the water, thinking, “The Blessed One still seems to be here.” C. Converting Nāḍikā and Naḍadaryā

source: །ཕྱོགས་དེ་ཉིད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་མོ་སྦུ་བུ་ཅན་དང་། སྦུབས་ཅན་གཉིས་བཏུལ་ཏོ།
en: In that very place the Blessed One converted two yakṣiṇīs, Nāḍikā and Naḍadaryā. D.

source: །མདུང་ཅན་གྱི་གྲོང་ཁྱེར་དུ་གཤེགས་སོ།
en: In the City of Kuntī, the Yakṣiṇī Named Kuntī The Blessed One went to the city of Kuntī.

source: །མདུང་ཅན་གྱི་གྲོང་ཁྱེར་ན་གནོད་སྦྱིན་མོ་མདུང་ཅན་ཞེས་བྱ་བ་ཁྲོ་ཞིང་གཏུམ་ལ་གཟུ་ལུམས་ཅན་ཞིག་གནས་པས་མདུང་ཅན་གྱི་གྲོང་ཁྱེར་གྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཀྱི་བུ་བཙས་ཤིང་བཙས་པ་དག་ཟ་བར་བྱེད་དོ།
en: In the city of Kuntī, there was a wrathful, fierce, and violent yakṣiṇī named Kuntī. Whenever a son was born to a brahmin or a householder in the city of Kuntī, she ate the child.

source: །མདུང་ཅན་གྱི་གྲོང་ཁྱེར་གྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་མདུང་ཅན་གྱི་གྲོང་ཁྱེར་དུ་གཤེགས་ནས་ཕྱོགས་ཆེ་གེ་མོ་ན་བཞུགས་སོ་ཞེས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་ཚོགས་ནས་ཚོགས་དང་ཁྱུ་ནས་ཁྱུར་ཕྲད་ཅིང་འདུས་ནས་མདུང་ཅན་གྱི་གྲོང་ཁྱེར་ནས་བྱུང་སྟེ།
en: When the brahmins and householders in the city of Kuntī heard that the Blessed One had arrived in the city of Kuntī and was staying at such-and-such a place, they met together, flocked together, swarmed together, left the city of Kuntī, and went to see the Blessed One.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ་ལྷགས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Upon their arrival, they bowed low until their foreheads touched the Blessed One’s feet, and then they sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་པ་དང་བཅོམ་ལྡན་འདས་ཀྱིས་མདུང་ཅན་གྱི་གྲོང་ཁྱེར་གྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཞེས་བྱ་བ་ནས།
en: Then the Blessed One, through talk consistent with the Dharma, . . . the brahmins and householders in the city of Kuntī.

source: །དེ་ནས་མདུང་ཅན་གྱི་གྲོང་ཁྱེར་གྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།། །།འདུལ་བ་གཞི། བམ་པོ་སུམ་བཅུ་རྩ་དྲུག་པ། བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སང་བདག་ཅག་གདུགས་ཚོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ་ཞེས་བྱ་བ་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་ཞལ་ཟས་གསོལ་ཟིན་ནས་ཕྱག་བཅབས་ཏེ་ལྷུང་བཟེད་གྱུ་བར་རིག་ནས་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །གསེར་གྱི་བྱ་མ་བུམ་བླངས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་གསོལ་བ་གདབ་པའི་ཕྱིར་འཁོད་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the brahmins and householders in the city of Kuntī rose from their seats, draped their upper robes over one shoulder, made the gesture of supplication to the Blessed One, and said to the Blessed One, “May the Blessed One together with the community of monks assent to our offer of a meal tomorrow.” . . . Knowing the Blessed One had finished his meal and washed his hands and his bowl, they held golden pitchers and sat down before the Blessed One to ask a favor.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུ་གདུག་པ་དང་། གནོད་སྦྱིན་གདུག་པ་དེ་དང་དེ་རྣམས་ནི་བཏུལ་ལགས་ན།
en: They said, “The Blessed One has converted many wicked nāgas and wicked yakṣas.

source: བཙུན་པ་གནོད་སྦྱིན་མོ་མདུང་ཅན་ཞེས་བགྱི་བ་འདི་བདག་ཅག་ལ་ཡུན་རིང་མོ་ཞིག་ནས་ཤ་ཁོན་མ་མཆིས་པར་ནི་ཤ་ཁོན་དུ་བགྱིད། འགྲན་ཟླ་མ་ལགས་པར་ནི་འགྲན་ཟླ་བགྱིད། གླགས་མ་བཙལ་བར་ནི་གླགས་ཚོལ་བར་བགྱིད་དེ། བྱིས་པ་བཙས་ཤིང་བཙས་པ་རྣམས་འཕྲོག་པར་བགྱིད་ལགས་ན། ཀྱེ་མའོ་བཅོམ་ལྡན་འདས་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ།
en: O Honored One, this yakṣiṇī named Kuntī has for a long time been hostile toward us who are not hostile, adversarial toward us who are not adversarial, and injurious to us who have not been injurious, and she snatches our children away whenever one is born.

source: གནོད་སྦྱིན་མོ་མདུང་ཅན་གདུལ་བར་གསོལ།
en: May the Blessed One have compassion and convert the yakṣiṇī Kuntī.”

source: དེའི་ཚེ་གནོད་སྦྱིན་མོ་མདུང་ཅན་འཁོར་དེ་ཉིད་དུ་འདུས་ཤིང་འདུག་པར་གྱུར་ཏོ།
en: At that time the yakṣiṇī Kuntī herself was sitting in the assembly.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་མོ་མདུང་ཅན་ལ་བཀའ་སྩལ་པ། མདུང་ཅན་ཁྱོད་ཀྱིས་ཐོས་སམ།
en: Then the Blessed One asked the yakṣiṇī Kuntī, “Kuntī, did you hear this?”

source: །མདུང་ཅན་ཁྱོད་ཀྱིས་ཐོས་སམ།
en: “Kuntī, did you hear this?”

source: བདེ་བར་གཤེགས་པ་བདག་གིས་ཐོས་ལགས་སོ།
en: “O Sugata, I did.”

source: །དམ་པ་མ་ཡིན་པའི་ཆོས་སྡིག་པ་དེ་ལས་ལོག་ཤིག །བཙུན་པ་དམ་ཞིག་བཅའ་སྟེ།
en: “Quit this inferior, evil conduct.”

source: གལ་ཏེ་འདི་དག་བདག་གི་སླད་དུ་གཙུག་ལག་ཁང་རྩིག་པར་བགྱིད་ན་བདག་ལྡོག་པར་བགྱིའོ།
en: “O Honored One, if they promise to have a monastery built for me, I will stop.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མདུང་ཅན་གྱི་གྲོང་ཁྱེར་གྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ལ་བཀའ་སྩལ་པ། བྲམ་ཟེ་དང་ཁྱིམ་བདག་ཁྱེད་ཀྱིས་ཐོས་སམ།
en: Then the Blessed One asked the brahmins and householders in the city of Kuntī, “Brahmins and householders, did you hear this?”

source: བཅོམ་ལྡན་འདས་ཐོས་ལགས་སོ།
en: “O Blessed One, we did.”

source: །ཁྱེད་ཅག་གིས་ཇི་ལྟར་བསྒྲུབ་པར་བྱ།
en: “What will you do?”

source: བཅོམ་ལྡན་འདས་བརྩིག་ལགས་སོ།
en: “O Blessed One, we will build it.

source: །བདེ་བར་གཤེགས་པ་བརྩིག་ལགས་སོ།
en: O Sugata, we will build it.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་མོ་མདུང་ཅན་འཁོར་དང་བཅས་ཏེ་བཏུལ་ནས་གཤེགས་སོ།
en: Thereupon the Blessed One departed, having converted the yakṣiṇī Kuntī, along with her attendants. E.

source: །འབྲ་གོ་ཅན་དུ་གཤེགས་པ་དང་འབྲ་གོ་ཅན་ན་བྱིས་པ་ཆུང་ངུ་དག་ཅིག་རྡུལ་གྱི་མཆོད་རྟེན་ལ་རྩེ་བར་བྱེད་དོ།
en: Kharjūrikā and the Stūpa Made of Dirt The Blessed One went to Kharjūrikā, where little children were making a stūpa out of dirt.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བྱིས་པ་ཆུང་ངུ་དག་རྡུལ་གྱི་མཆོད་རྟེན་ལ་རྩེ་བ་གཟིགས་སོ། །གཟིགས་ནས་ཀྱང་ཡང་གནོད་སྦྱིན་ལག་ན་རྡོ་རྗེ་ལ་བཀའ་སྩལ་པ། ལག་ན་རྡོ་རྗེ་ཁྱོད་ཀྱིས་བྱིས་པ་ཆུང་ངུ་རྡུལ་གྱི་མཆོད་རྟེན་ལ་རྩེ་བ་དག་མཐོང་ངམ།
en: The Blessed One saw the little children making a stūpa out of dirt and he said to the yakṣa Vajrapāṇi, “Vajrapāṇi, do you see the little children making a stūpa out of dirt?”

source: །ལག་ན་རྡོ་རྗེ་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ལོ་བཞི་བརྒྱ་ལོན་པ་ན་འདིར་ཀུ་ཤ་ནའི་རིགས་ཀྱི་རྒྱལ་པོ་ཀ་ནིས་ཀ་ཞེས་བྱ་བ་འབྱུང་བར་འགྱུར་བ་དེས་ཕྱོགས་འདིར་མཆོད་རྟེན་རྩིག་པར་འགྱུར་ཏེ།
en: “Vajrapāṇi, when four hundred years have passed after I am completely emancipated, here will appear a king from the lineage of Kuṣāṇa named Kaniṣka. He will build a stūpa in this place.

source: དེའི་མིང་ཀ་ནིས་ཀའི་མཆོད་རྟེན་ཞེས་བྱ་བར་འགྱུར་ཞིང་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ན་ཡང་སངས་རྒྱས་ཀྱི་བྱ་བ་བྱེད་པར་འགྱུར་རོ།
en: Its name will be Kaniṣka Stūpa, and it will perform acts of a buddha even though by then I will have been completely emancipated.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རོ་ཧི་ཏ་ཀ་ནས་ཀླུའི་རྒྱལ་པོ་སོག་མ་མེད་ཀྱི་གནས་ཀྱི་བར་དུ་སྲོག་ཆགས་ས་ཡ་ཕྲག་བདུན་དང་འབུམ་ཕྲག་བདུན་བཏུལ་ནས་རོ་ཧི་ཏ་ཀར་གཤེགས་ཏེ་གཙུག་ལག་ཁང་དུ་ཞུགས་ནས་ནང་དུ་ཡང་དག་བཞག་གོ།
en: After that, having converted seven million seven hundred thousand beings between Rohitaka and the nāga king Apalāla’s residence, the Blessed One returned to Rohitaka. He entered the monastery and went into seclusion.

source: །བཅོམ་ལྡན་འདས་དགོངས་ཀ་ནང་དུ་ཡང་དག་འཇོག་ལས་བཞེངས་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One arose from his seclusion in the evening and said to the venerable Ānanda, “Ānanda, let us go to Ādirājya.”

source: ཀུན་དགའ་བོ་དང་པོའི་རྒྱལ་སྲིད་གང་ན་བ་དེར་འདོང་ངོ་། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་སྔར་ནི་འདི་སྐད་ཅེས་ཀུན་དགའ་བོ་བྱང་ཕྱོགས་སུ་ཀླུའི་རྒྱལ་པོ་སོག་མ་མེད་འདུལ་དུ་འདོང་ངོ་།
en: Then the venerable Ānanda asked the Blessed One, “O Honored One, the Blessed One once said, ‘Ānanda, let us go to convert the nāga king Apalāla in the northern region.

source: །བྱང་ཕྱོགས་ན་ནི་ཕན་ཡོན་རྣམ་པ་ལྔ་ཡོད་དོ་ཞེས་གསུངས་ལ། ད་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་དུ་ཀུན་དགའ་བོ་དང་པོའི་རྒྱལ་སྲིད་གང་ན་བ་དེར་འདོང་ངོ་ཞེས་གསུངས་ན་དེ་ཇི་ལྟ་བུ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: There are five advantages of the northern region.’ Now the Blessed One has just said, ‘Ānanda, let us go to Ādirājya.’ What does this mean?”

source: ཀུན་དགའ་བོ་ང་གནོད་སྦྱིན་ལག་ན་རྡོ་རྗེ་དང་ཐབས་ཅིག་ཏུ་བྱང་ཕྱོགས་སུ་གཤེགས་ནས་ཏ་མ་སའི་ཚལ་རྣམས་ལུང་བསྟན་ཏོ་ཞེས་བྱ་བ་ནས་རྡུལ་གྱི་མཆོད་རྟེན་ལུང་བསྟན་ཏོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: The Blessed One answered, “Ānanda, I have gone to the northern region with Vajrapāṇi. I predicted Tamasā Forest, . . . predicted the stūpa made of dirt.

source: །ཀུན་དགའ་བོ་རོ་ཧི་ཏ་ཀ་ནས་ཀླུའི་རྒྱལ་པོ་སོག་མ་མེད་ཀྱི་གནས་ཀྱི་བར་དུ་དེ་བཞིན་གཤེགས་པས་སྲོག་ཆགས་ས་ཡ་ཕྲག་བདུན་དང་འབུམ་ཕྲག་བདུན་བཏུལ་ཏེ།
en: Ānanda, the Tathāgata has converted seven million seven hundred thousand beings between Rohitaka and the residence of the nāga king Apalāla.

source: བྱང་ཕྱོགས་ན་ནི་ཉེས་དམིགས་ལྔ་ཡོད་དེ།
en: There are five disadvantages of the northern region: the land is uneven;

source: མཐོན་དམན་ཅན་དང་། སྡོང་དུམ་དང་། ཚེར་མས་གང་བ་དང་། རྡོ་བ་དང་། གསེག་མ་དང་། གྱོ་མོ་མང་བ་དང་། ཁྱི་ཟ་བ་དང་། བུད་མེད་གནས་ངན་ལེན་ཀུན་དུ་སྤྱོད་པའོ།། །།སྡོམ་ལ།
en: it is full of logs and thorns; there are many stones, pebbles, and gravel; dogs bite; and women behave wickedly.” Chapter Eight Summary of Contents:

source: དང་པོའི་རྒྱལ་སྲིད་རྟ་བཟངས་དང་། །བཅོམ་བརླག་དང་ནི་ཨོ་ཏ་ལའི།
en: Ādirājya, Bhadrāśva, Mathurā, Otalā Park,

source: །ཀུན་དགའ་ར་བ་དགྲ་མཐའ་དང་། །ཚུགས་པར་དཀའ་དང་གང་གཱའི་ཆུ།
en: Vairambhya, Ayodhyā, The Ganges,

source: །ཡི་དགས་དུས་དཔོག་ཕྱི་མ་ཡིན།
en: Hungry Ghosts, and Velāma. I.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཡུལ་དཔའ་སྡེ་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ན་དང་པོའི་རྒྱལ་སྲིད་དུ་གཤེགས་ནས།
en: Ādirājya Traveling through the country of Śūrasena, the Blessed One then went to Ādirājya.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཕྱོགས་འདིར་རྒྱལ་པོ་མང་པོས་བཀུར་བ་དང་པོ་རྒྱལ་སྲིད་ཀྱི་དབང་བསྐུར་བས་དབང་བསྐུར་བ་དེ་ནི་དང་པོའི་རྒྱལ་པོ་ཡིན་ནོ།
en: There the Blessed One said to the venerable Ānanda, “Ānanda, in this place King Mahāsammata, who was the first king, was anointed.

source: །དེའི་ཕྱིར་འདི་དང་པོའི་རྒྱལ་སྲིད་ཅེས་བྱ་བར་གྲགས་སོ།
en: Therefore, this place was named Ādirājya (first kingship).” II. Bhadrāśva

source: །རྟ་བཟངས་སུ་གཤེགས་ནས།
en: The Blessed One went to Bhadrāśva.
